def main():
    
    # 1. консольное приложение для копирования файлов
    # 2. необходимо реализовать логику запуска: 
    #   file-copier-py -s <указание путей источников> -t <указание целевого пути>
    # 3. создать класс для настроек
    # 4. настройки сохраняем в json
    # 5. сначала проверяются аргументы в команде
    # 6. затем проверяются настройки
    # 7. если нет ни того не другого, то запрашиваем количество путей, пути и целевой путь
    # 8. потом копируем содержимое
    # 9. логируем процесс в файл
    # 10. допустимые категории событий: error, info, debug
    
    
    print("Hello world")

if __name__ == "__main__":
    main()